# Numpy와 pandas
- pandas 는 numpy 기반 1차원 배열 데이터를 기반으로 header(column name) 준 데이터를 처리하는 데 특화됨


# 데이터 불러오기 및 저장
- 데이터베이스, 스프레드시트, csv, json 등등
# 데이터프레임
- 데이터프레임 이해
- 데이터 분석

In [3]:
import numpy as np
import pandas as pd

item_no = np.random.randint(0, 10, size=5)
item_name = np.array(['dress','shirt', 'shorts', 'pants', 'hat'])
item_values = np.random.rand(5) * 1000

print(f'{item_no = }')
print(f'{item_name = }')

data = {
    'item_no': [7,5,0,3,2],
    'item_name': ['dress','shirt', 'shorts', 'pants', 'hat'],
    'price' : [100, 200, 150, 300, 50]
}

df = pd.DataFrame(data)
df
# print(df)

# print(type(df))
# print(df['item_no'])
# print(type(df['item_no']))

item_no = array([4, 6, 2, 9, 5])
item_name = array(['dress', 'shirt', 'shorts', 'pants', 'hat'], dtype='<U6')

   item_no item_name  price
0        7     dress    100
1        5     shirt    200
2        0    shorts    150
3        3     pants    300
4        2       hat     50

In [9]:
df.dtypes

df.loc[2, 'item_name'] = 0
print(df)
print(df.dtypes)

   item_no item_name       value
0        7     dress  246.039422
1        5     shirt   10.786688
2        0         0  391.960119
3        3     pants  707.151457
4        2       hat  597.699950
item_no        int32
item_name     object
value        float64
dtype: object

In [17]:
data = {
    'category':['A','B','A','B'],
    'Name': ['John', 'Anna', 'Perter', 'Linda'],
    'Age':[28,34,45,32],
    'Income': [50000, 6000, 8000, 7500]
}

df = pd.DataFrame(data)
df

  category    Name  Age  Income
0        A    John   28   50000
1        B    Anna   34    6000
2        A  Perter   45    8000
3        B   Linda   32    7500

In [11]:
# groupby
df_grouped = df.drop('Name', axis=1).groupby('category').median() # sum, mean, max, min
df_grouped

           Age   Income
category
A         36.5  29000.0
B         33.0   6750.0

In [12]:
df_pivot = pd.pivot_table(data=df, index='category', 
        values=['Age','Income'], aggfunc=['sum','max'])
df_pivot

         sum        max
         Age Income Age Income
category
A         73  58000  45  50000
B         66  13500  34   7500

In [23]:
df['name_str'] = df['Name'].apply(lambda x: x + '_10')
df['name_str'] = df.apply(lambda x: x.Name + '_10', axis=1)
# df['name'] = df.apply(lambda row: row.Name+str(row.Age), axis=1)
df

  category    Name  Age  Income   name_str
0        A    John   28   50000    John_10
1        B    Anna   34    6000    Anna_10
2        A  Perter   45    8000  Perter_10
3        B   Linda   32    7500   Linda_10